In [6]:
import os
from datetime import datetime
import pandas as pd

In [37]:
!ls .

README.md      Untitled.ipynb features.py    io.py          target.py

In [7]:
data_dir = '../../data/Stocks'

In [10]:
symbols = [f.split('.us.txt')[0] for f in os.listdir(data_dir) if f.endswith('.us.txt')]
print(symbols[:10])

['iba', 'wpz', 'opnt', 'indf', 'flic', 'nbhc', 'ncs', 'grvy', 'lgcyo', 'eqco']

In [11]:
filepath = os.path.join(data_dir, symbols[0] + '.us.txt')

In [12]:
df = pd.read_csv(filepath)

In [13]:
df.head()

         Date    Open    High     Low   Close  Volume  OpenInt
0  2005-02-25  12.868  12.982  12.834  12.834   15928        0
1  2005-02-28  13.536  13.536  13.273  13.281   16382        0
2  2005-03-01  13.185  13.299  13.185  13.299    1250        0
3  2005-03-02  13.361  13.395  13.273  13.291    8760        0
4  2005-03-03  13.361  13.404  12.966  13.218    9897        0

In [14]:
df.tail()

            Date   Open   High     Low  Close  Volume  OpenInt
3194  2017-11-06  59.00  59.38  58.195  59.15   19854        0
3195  2017-11-07  59.30  59.30  58.430  58.73    5240        0
3196  2017-11-08  59.19  59.42  58.245  58.75    3537        0
3197  2017-11-09  58.48  59.19  58.480  58.76    8519        0
3198  2017-11-10  59.03  59.03  58.130  58.37   12314        0

In [38]:
weekdays = pd.bdate_range(start='2017-11-04', end='2017-11-08').astype(str)

In [39]:
weekdays

Index(['2017-11-06', '2017-11-07', '2017-11-08'], dtype='object')

In [20]:
df['Date'] = df['Date'].astype(str)

In [21]:
time_df = pd.DataFrame({'Date': weekdays})

In [22]:
df.shape

(3199, 7)

In [23]:
df_merge = pd.merge(time_df, df, on=['Date'], how='left')

In [25]:
df_merge.shape

(3312, 7)

In [33]:
df_test= pd.DataFrame({'a': [1, 3, 5, 7, 9], 'b': [1, 2, 3, 4, 5], 'c': [3,4,5,6,7]})

In [34]:
df_test = pd.merge(pd.DataFrame(dict(a=[1,2,3,4,5,6,7,8,9])), df_test, on=['a'], how='left')

In [35]:
df_test

   a    b    c
0  1  1.0  3.0
1  2  NaN  NaN
2  3  2.0  4.0
3  4  NaN  NaN
4  5  3.0  5.0
5  6  NaN  NaN
6  7  4.0  6.0
7  8  NaN  NaN
8  9  5.0  7.0

In [36]:
df_test.ffill()

   a    b    c
0  1  1.0  3.0
1  2  1.0  3.0
2  3  2.0  4.0
3  4  2.0  4.0
4  5  3.0  5.0
5  6  3.0  5.0
6  7  4.0  6.0
7  8  4.0  6.0
8  9  5.0  7.0